spec/fixtures/files/stripe/invoice_subscription_month.json

{
  "id": "in_1J2D3hHwuhGySQCdf5x2g990",
  "object": "invoice",
  "account_country": "SE",
  "account_name": "GoClimate",
  "account_tax_ids": null,
  "amount_due": 700,
  "amount_paid": 700,
  "amount_remaining": 0,
  "application_fee_amount": null,
  "attempt_count": 1,
  "attempted": true,
  "auto_advance": false,
  "billing_reason": "subscription_create",
  "charge": "ch_1J2D3iHwuhGySQCdNR5ofv2r",
  "collection_method": "charge_automatically",
  "created": 1623666621,
  "currency": "eur",
  "custom_fields": null,
  "customer": "cus_JfY9Kidn1h4KiY",
  "customer_address": null,
  "customer_email": "ksjdf@example.com",
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [

  ],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [

  ],
  "description": "Tack för du vill vara med och stoppa klimatförändringarna!\n\nBetala här: ",
  "discount": null,
  "discounts": [

  ],
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1A09wWHwuhGySQCd/invst_JfYA6ZzrxR804ctrmWh9oGD3IWlGcJM",
  "invoice_pdf": "https://pay.stripe.com/invoice/acct_1A09wWHwuhGySQCd/invst_JfYA6ZzrxR804ctrmWh9oGD3IWlGcJM/pdf",
  "last_finalization_error": null,
  "lines": {"object":"list","data":[{"id":"il_1J2D3hHwuhGySQCd8TtUetAG","object":"line_item","amount":700,"currency":"eur","description":"1 × Lifestyle Carbon Offsetting (at €7.00 / month)","discount_amounts":[],"discountable":true,"discounts":[],"livemode":false,"metadata":{},"period":{"end":1626258621,"start":1623666621},"plan":{"id":"offsetting_subscription_2021_eur_7_00","object":"plan","active":true,"aggregate_usage":null,"amount":700,"amount_decimal":"700","billing_scheme":"per_unit","created":1623416106,"currency":"eur","interval":"month","interval_count":1,"livemode":false,"metadata":{"co2e":"1167"},"nickname":null,"product":"offsetting_subscription_2021","tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"price":{"id":"offsetting_subscription_2021_eur_7_00","object":"price","active":true,"billing_scheme":"per_unit","created":1623416106,"currency":"eur","livemode":false,"lookup_key":null,"metadata":{"co2e":"1167"},"nickname":null,"product":"offsetting_subscription_2021","recurring":{"aggregate_usage":null,"interval":"month","interval_count":1,"trial_period_days":null,"usage_type":"licensed"},"tiers_mode":null,"transform_quantity":null,"type":"recurring","unit_amount":700,"unit_amount_decimal":"700"},"proration":false,"quantity":1,"subscription":"sub_JfYAJsKMCumBzr","subscription_item":"si_JfYAIlmeIU9y6a","tax_amounts":[],"tax_rates":[],"type":"subscription"}],"has_more":false,"total_count":1,"url":"/v1/invoices/in_1J2D3hHwuhGySQCdf5x2g990/lines"},
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "number": "72D03F35-0001",
  "on_behalf_of": null,
  "paid": true,
  "payment_intent": "pi_1J2D3iHwuhGySQCddt98YXPH",
  "payment_settings": {"payment_method_options":null,"payment_method_types":null},
  "period_end": 1623666621,
  "period_start": 1623666621,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "paid",
  "status_transitions": {"finalized_at":1623666621,"marked_uncollectible_at":null,"paid_at":1623666621,"voided_at":null},
  "subscription": "sub_JfYAJsKMCumBzr",
  "subtotal": 700,
  "tax": null,
  "total": 700,
  "total_discount_amounts": [

  ],
  "total_tax_amounts": [

  ],
  "transfer_data": null,
  "webhooks_delivered_at": 1623666621
}
